hankso/esp32/espbase/main/drivers.c
#ifdef CONFIG_BASE_USE_I2S

#ifdef TARGET_IDF_5
static i2s_chan_handle_t i2s_handle;
#   define I2S_ACQUIRE()    i2c_channel_enable(i2s_handle)
#   define I2S_RELEASE()    i2c_channel_disable(i2s_handle)
#   define I2S_READ(...)    i2c_channel_read(i2s_handle, __VA_ARGS__)
#   define PDM_SHZ          CONFIG_BASE_PDM_SAMPLE_RATE
#   define PDM_BPC          ( I2S_DATA_BIT_WIDTH_16BIT / 8 )
#   define PDM_TYPE         int16_t
#   ifdef CONFIG_BASE_PDM_STEREO
#       define PDM_NCH      I2S_SLOT_MODE_STEREO
#   else
#       define PDM_NCH      I2S_SLOT_MODE_MONO
#   endif

static void i2s_initialize() {
#   define DEFAULT(n, ...)  I2S_##n##_DEFAULT_CONFIG(__VA_ARGS__)
    i2s_chan_config_t chan_conf = DEFAULT(CHANNEL, NUM_I2S, I2S_ROLE_MASTER);
    i2s_pdm_rx_config_t pdm_conf = {
        .clk_cfg  = DEFAULT(PDM_RX_CLK, PDM_SHZ),
        .slot_cfg = DEFAULT(PDM_RX_SLOT, PDM_BPC * 8, PDM_NCH),
        .gpio_cfg = { .clk = PIN_CLK, .din = PIN_DAT },
    };
#   undef DEFAULT
    ESP_ERROR_CHECK( i2s_new_channel(&chan_conf, NULL, &i2s_handle) );
    ESP_ERROR_CHECK( i2s_channel_init_pdm_rx_mode(i2s_handle, &pdm_conf) );
}
#else // TARGET_IDF_4
#   define I2S_ACQUIRE()    i2s_start(NUM_I2S)
#   define I2S_RELEASE()    i2s_stop(NUM_I2S)
#   define I2S_READ(...)    i2s_read(NUM_I2S, __VA_ARGS__)
#   define PDM_SHZ          CONFIG_BASE_PDM_SAMPLE_RATE
#   define PDM_BPC          ( I2S_BITS_PER_SAMPLE_16BIT / 8 )
#   define PDM_TYPE         int16_t
#   ifdef CONFIG_BASE_PDM_STEREO
#       define PDM_NCH      I2S_CHANNEL_STEREO
#       define PDM_FCH      I2S_CHANNEL_FMT_RIGHT_LEFT
#   else
#       define PDM_NCH      I2S_CHANNEL_MONO
#       define PDM_FCH      I2S_CHANNEL_FMT_ONLY_RIGHT
#   endif

static void i2s_initialize() {
    i2s_config_t i2s_conf = {
        .mode                   = I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_PDM,
        .sample_rate            = PDM_SHZ,
        .bits_per_sample        = PDM_BPC * 8,
        .channel_format         = PDM_FCH,
        .communication_format   = I2S_COMM_FORMAT_STAND_I2S,
        .intr_alloc_flags       = ESP_INTR_FLAG_LEVEL2,
        .dma_buf_count          = 8,
        .dma_buf_len            = 128,
    };
    i2s_pin_config_t pin_conf = {
        .mck_io_num     = I2S_PIN_NO_CHANGE,
        .bck_io_num     = I2S_PIN_NO_CHANGE,
        .ws_io_num      = PIN_CLK,
        .data_out_num   = I2S_PIN_NO_CHANGE,
        .data_in_num    = PIN_DAT,
    };
    ESP_ERROR_CHECK( i2s_driver_install(NUM_I2S, &i2s_conf, 0, NULL) );
    ESP_ERROR_CHECK( i2s_set_pin(NUM_I2S, &pin_conf) );
    ESP_ERROR_CHECK( i2s_stop(NUM_I2S) );
}
#endif // TARGET_IDF_5

static void aud_visual(void *arg, esp_event_base_t b, int32_t id, void *data) {
    static char eqls[80 - 4 - 3 - 13];
    FILE *stream = arg;
    audio_evt_t *evt = *(audio_evt_t **)data;
    if (id == AUD_EVENT_START) {
        memset(eqls, '=', sizeof(eqls) - 1);
        eqls[sizeof(eqls) - 1] = '\0';
    } else if (id == AUD_EVENT_STOP) {
        fputc('\n', stream);
        fflush(stream);
    }
    if (id != AUD_EVENT_DATA || evt->id % 10 || !evt->mode->nch) return;
    size_t nch = evt->mode->nch, vmax = BIT(evt->mode->depth * 8 - 1);
    size_t tlen = (sizeof(eqls) - (nch - 1) * 6) / nch;
    PDM_TYPE *buf = evt->data, vol[nch], len[nch];
    LOOPN(i, evt->len / nch / evt->mode->depth) {
        LOOPN(j, nch) {
            vol[j] = MAX(vol[j], ABS(buf[i * nch + j]));
        }
    }
    fprintf(stream, "\r%s [", format_timestamp_us(0));
    LOOPN(j, nch) {
        vol[j] = vol[j] * 100 / vmax;           // 0 ~ 100
        len[j] = vol[j] * tlen / 100;           // 0 ~ tlen
        if (j) fputc('|', stream);
        if (j % 2 || nch == 1) {
            fprintf(stream, "%-3d%%%.*s%c%*s",
                vol[j], len[j], eqls, vol[j] ? '+' : ' ', tlen - len[j], "");
        } else {
            fprintf(stream, "%*s%c%.*s%3d%%",
                tlen - len[j], "", vol[j] ? '+' : ' ', len[j], eqls, vol[j]);
        }
    }
    fputc(']', stream);
    fflush(stream);
}

static void audio_capture(void *arg) {
    audio_mode_t mode = { PDM_SHZ, PDM_NCH, PDM_BPC };
    wav_header_t WAV = {
        "RIFF", -1,
        "WAVE",
        "fmt ", WAV_HEADER_FMT_LEN,
            0x01, mode.nch, mode.srate,
            mode.nch * mode.depth * mode.srate,
            mode.nch * mode.depth, mode.depth * 8,
        "data", -1
    };
    size_t dlen = (uint64_t)WAV.Bps * (uint32_t)arg / 1000;
    size_t rlen, plen = sizeof(void **), blen = WAV.Bps / 50; // 20ms buffer
    WAV.filelen = (WAV.datalen = dlen) + sizeof(WAV) - 8;
    audio_evt_t wav = { .len = sizeof(WAV), .data = &WAV };
    audio_evt_t evt = { .data = malloc(blen), .mode = &mode };
    void *dptr = &wav;
    if (!evt.data) goto exit;
    AVC_POST(AUD_EVENT_START, &dptr, plen, -1); msleep(10);
    dptr = &evt;
    I2S_ACQUIRE();
    for (evt.id = 0; audio_run && dlen; evt.id++) {
        if (I2S_READ(evt.data, blen, &rlen, TIMEOUT(25)) || !rlen) break;
        dlen -= (evt.len = MIN(rlen, dlen));
        AVC_POST(AUD_EVENT_DATA, &dptr, plen, 15);
    }
    I2S_RELEASE();
    memset(dptr = &wav, 0, sizeof(wav));
    AVC_POST(AUD_EVENT_STOP, &dptr, plen, -1); msleep(10);
    UREGEVTS(AVC, aud_shdl);
    TRYFREE(evt.data);
exit:
    vTaskDelete(NULL);
}
#   undef I2S_ACQUIRE
#   undef I2S_RELEASE
#   undef I2S_READ
#   undef PDM_TYPE
#   undef PDM_SHZ
#   undef PDM_NCH
#   undef PDM_BPC
#endif // CONFIG_BASE_USE_I2S

#ifdef CONFIG_BASE_USE_CAM
static void cam_initialize() {
    camera_config_t conf = {
        // TODO
    };
    esp_err_t err = esp_camera_init(&conf);
    if (!err) {
        sensor_t *cam = esp_camera_sensor_get();
        if (cam->id.PID == OV3660_PID) {
            cam->set_brightness(cam, 1);
            cam->set_saturation(cam, -2);
        }
        cam->set_framesize(cam, FRAMESIZE_HD);
    } else {
        ESP_LOGE(TAG, "Init camera failed: %s", esp_err_to_name(err));
    }
}

static void vid_visual(void *arg, esp_event_base_t b, int32_t id, void *data) {
    FILE *stream = arg;
    video_evt_t *evt = *(video_evt_t **)data;
    if (id == VID_EVENT_STOP) {
        fputc('\n', stream);
    } else if (id == VID_EVENT_DATA && (evt->id % evt->mode->fps) == 0) {
        fprintf(stream, "\r%08d %dx%dx%d %.4s %dBytes",
                evt->id, evt->mode->width, evt->mode->height,
                evt->mode->depth, evt->mode->fourcc, evt->len);
    }
    fflush(stream);
}

static void video_capture(void *arg) {
    sensor_t *cam = esp_camera_sensor_get();
    if (!cam) return;
    const resolution_info_t *res = resolution + cam->status.framesize;
    video_mode_t mode = { 15, res->width, res->height, 3, "MJPG" }; // FIXME fps
    uint32_t ms = (uint32_t)arg, retry = 5;
    uint32_t BPF = mode.width * mode.height * mode.depth * 0.6; // BytePerFrame
    avi_header_t AVI = {
        "RIFF", -1,
        "AVI ",
        "LIST", AVI_HEADER_HDLR_LEN, "hdlr",
            "avih", AVI_HEADER_AVIH_LEN,
                1000000 / mode.fps, mode.fps * BPF, 0, 0x910, -1, 0, 1,
                0x100000, mode.width, mode.height, { 0, 0, 0, 0 },
        "LIST", AVI_HEADER_STRL_LEN, "strl",
            "strh", AVI_HEADER_STRH_LEN,
                "vids", "MJPG", 0, 0, 0, 0, 1, mode.fps, 0, -1,
                BPF, -1, 0, 0, 0, mode.width, mode.height,
            "strf", AVI_HEADER_STRF_LEN,
                AVI_HEADER_STRF_LEN, mode.width, mode.height, 1,
                mode.depth * 8, "MJPG", BPF, 0, 0, 0, 0,
        "LIST", -1, "movi",
    };
    size_t nframe = ms * (ms == -1 ? 1 : mode.fps), plen = sizeof(void **);
    AVI.total_frames = AVI.length = nframe;
    camera_fb_t *fb = NULL;
    video_evt_t avi = { .len = sizeof(AVI), .data = &AVI };
    video_evt_t evt = { .data = NULL, .mode = &mode };
    void *dptr = &avi;
    AVC_POST(VID_EVENT_START, &dptr, plen, -1); msleep(10);
    dptr = &evt;
    vTaskResume(xTaskGetHandle("cam_task"));
    for (evt.id = 0; video_run && retry && evt.id < nframe; evt.id++) {
        if (evt.data && fb && fb->buf != evt.data) free(evt.data);
        TRYNULL(fb, esp_camera_fb_return);
        if (!( fb = esp_camera_fb_get() )) break;
        if (fb->format == PIXFORMAT_JPEG) {
            evt.data = fb->buf;
            evt.len = fb->len;
        } else if (!frame2jpg(fb, 80, (uint8_t **)&evt.data, &evt.len)) {
            ESP_LOGE(TAG, "JPEG compression failed");
            retry--;
        }
        AVC_POST(VID_EVENT_DATA, &dptr, plen, 33);
    }
    vTaskSuspend(xTaskGetHandle("cam_task"));
    memset(dptr = &avi, 0, sizeof(avi));
    AVC_POST(VID_EVENT_STOP, &dptr, plen, -1); msleep(10);
    UREGEVTS(AVC, vid_shdl);
    if (evt.data && fb && fb->buf != evt.data) free(evt.data);
    TRYNULL(fb, esp_camera_fb_return);
    vTaskDelete(NULL);
}
#endif // CONFIG_BASE_USE_CAM

