hankso/esp32/espbase/main/drivers.c
/******************************************************************************
 * Task Watchdog
 */

static void twdt_initialize() {
#if defined(CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0) \
 || defined(CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1)
    // Idle tasks are created on each core automatically by RTOS scheduler
    // with the lowest possible priority (0). Our tasks have higher priority,
    // thus leaving almost no time for idle tasks to run. Disable WDT on them.
#   ifdef CONFIG_FREERTOS_UNICORE
    LOOPN(i, 1)
#   else
    LOOPN(i, 2)
#   endif
    {
        TaskHandle_t idle = xTaskGetIdleTaskHandleForCPU(i);
        if (idle && !esp_task_wdt_status(idle) && !esp_task_wdt_delete(idle)) {
            ESP_LOGI(TAG, "Task IDLE%d @ CPU%d removed from WDT", i, i);
        }
    }
#endif // CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPUx
}

esp_err_t twdt_feed() {
#ifdef CONFIG_TASK_WDT
    return esp_task_wdt_reset();
#else
    return ESP_OK;
#endif
}

void driver_initialize() {
    const char * tags[] = {
        "gpio", "button", "adc button", "led_indicator", "Knob"
    };
    ITERV(tag, tags) { esp_log_level_set(tag, ESP_LOG_WARN); }

    uart_initialize();
    pwm_initialize();
#ifdef CONFIG_BASE_USE_ADC
    adc_initialize();
#endif
#ifdef CONFIG_BASE_USE_DAC
    dac_initialize();
#endif
#ifdef CONFIG_BASE_USE_SPI
    spi_initialize();
#endif
#ifdef CONFIG_BASE_USE_I2C
    i2c_initialize();
#endif
#ifdef CONFIG_BASE_USE_GPIOEXP
    gexp_initialize();
#endif
    gpio_initialize();
#ifdef CONFIG_BASE_USE_LED
    led_initialize();
#endif
#ifdef CONFIG_BASE_USE_I2S
    i2s_initialize();
#endif
#ifdef CONFIG_BASE_USE_CAM
    cam_initialize();
#endif
    twdt_initialize();
}
